<?php
/**
 * @Author: llqhz
 * @Date:   2017-11-08 09:12:54
 * @Last Modified by:   llqhz
 * @Last Modified time: 2017-11-08 10:06:21
 */
/*
SEO Search Engine
//免费 方式

SEM 搜索引擎营销
百度竞价排名 : 出价越高,排名越高
//
//盈利 方式  => 广告法   百度推荐->广告

//对比
//按效果付费  恶意点击识别
//SEM高投入 SEO低投入
//SEM耗时短,效益快
//广告法 SEM->SEO

IP PV UV
IP 独立ip访问的用户
PV 页面浏览量或点击量
UV 独立访客数
tips: 同一用户可以用不同的ip登录,ip计数,uv为1
      不同用户用相同ip登录,ip为1,uv计数

搜索引擎排名
statcounter
baidu搜索 360搜索(十天占比10%) 搜狗

SEO排名机制: 权重提升
1: 搜索引擎蜘蛛 快照存数据库
2: 权重

google: PageRank(停止更新) 转化率/跳出率
baidu:

提高权重:
1 提交入口: 百度 谷歌 360 搜狗 必应
2 优化三要素: 标题 关键字 描述
3 外链 友情链接(权重高德网站)
        内容相近 单向链接 双向链接(分享流量) 单向直连(黑冒) 灌水式外链(帖子中)
4 内链 本站页面互链
5 内容质量 更新 质量 原创(伪原创) 关键词密度 2-8%
